import datetime

# адреса серверов
URL_SCOOTER = 'https://qa-scooter.praktikum-services.ru/'
URL_DZEN = 'https://dzen.ru/?yredirect=true'

# эндпоинты
EP_ORDER = 'order'

# размеры окна
WIDTH = 1280
HEIGHT = 720

answers = [[0, 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'],
           [1, 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать'
            ' несколько заказов — один за другим.'],
           [2, 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды'
            ' начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная'
            ' аренда закончится 9 мая в 20:30.'],
           [3, 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'],
           [4, 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'],
           [5, 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься'
               ' без передышек и во сне. Зарядка не понадобится.'],
           [6, 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'],
           [7, 'Да, обязательно. Всем самокатов! И Москве, и Московской области.']]

orders = [['Иван',
           'Иванов',
           'Ленинградская, 158-25',
           'Лужники',
           '+79988775544',
           (datetime.date.today() + datetime.timedelta(days=2)).strftime("%d.%m.%Y"),
           1],
          ['Петр',
           'Петров',
           'Питерская, 43-83',
           'Маяковская',
           '+73322110099',
           (datetime.date.today() + datetime.timedelta(days=3)).strftime("%d.%m.%Y"),
           2]]
